<a href="https://colab.research.google.com/github/Ganapathi-tech/ganapathi-tech-Ganesh/blob/main/GradientBoosting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic_train.csv")

In [ ]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic = titanic.drop(["PassengerId", "Name","SibSp","Parch", "Ticket", "Cabin"], axis = 1)

In [ ]:
titanic

     Survived  Pclass  Gender   Age     Fare Embarked
0           0       3    male  22.0   7.2500        S
1           1       1  female  38.0  71.2833        C
2           1       3  female  26.0   7.9250        S
3           1       1  female  35.0  53.1000        S
4           0       3    male  35.0   8.0500        S
..        ...     ...     ...   ...      ...      ...
886         0       2    male  27.0  13.0000        S
887         1       1  female  19.0  30.0000        S
888         0       3  female   NaN  23.4500        S
889         1       1    male  26.0  30.0000        C
890         0       3    male  32.0   7.7500        Q

[891 rows x 6 columns]

In [ ]:
encod = pd.get_dummies(titanic["Gender"], drop_first= "True")

In [ ]:
encod

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [ ]:
titanic = pd.concat([titanic, encod], axis = 1)

In [ ]:
titanic.head()

   Survived  Pclass  Gender   Age     Fare Embarked  male
0         0       3    male  22.0   7.2500        S     1
1         1       1  female  38.0  71.2833        C     0
2         1       3  female  26.0   7.9250        S     0
3         1       1  female  35.0  53.1000        S     0
4         0       3    male  35.0   8.0500        S     1

In [ ]:
titanic = titanic.drop("Gender", axis = 1)

In [ ]:
titanic.head()

   Survived  Pclass   Age     Fare Embarked  male
0         0       3  22.0   7.2500        S     1
1         1       1  38.0  71.2833        C     0
2         1       3  26.0   7.9250        S     0
3         1       1  35.0  53.1000        S     0
4         0       3  35.0   8.0500        S     1

In [ ]:
X = titanic.drop("Survived", axis = 1)

In [ ]:
y = titanic["Survived"]

In [ ]:
X.head()

   Pclass   Age     Fare Embarked  male
0       3  22.0   7.2500        S     1
1       1  38.0  71.2833        C     0
2       3  26.0   7.9250        S     0
3       1  35.0  53.1000        S     0
4       3  35.0   8.0500        S     1

In [ ]:
y.head

<bound method NDFrame.head of 0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64>

In [ ]:
X.isnull().sum()

Pclass      0
Age         0
Fare        0
Embarked    2
male        0
dtype: int64

In [ ]:
y.isnull().sum()

0

In [ ]:
import numpy as np

In [ ]:
np.round(X["Age"].mean())

30.0

In [ ]:
X["Age"] = X["Age"].fillna(30)

In [ ]:
a = X["Embarked"].mode()

In [ ]:
X["E"] = X["Embarked"].fillna(a[0])

KeyError: ignored

In [ ]:
X["Embarked"]

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [ ]:
X.isna().sum()

Pclass      0
Age         0
Fare        0
Embarked    0
male        0
dtype: int64

In [ ]:
X["Embarked"].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
lbe = LabelEncoder()

In [ ]:
lbe.fit(X["Embarked"])

LabelEncoder()

In [ ]:
emb_trans = lbe.transform(X["Embarked"])

In [ ]:
emb_trans

array([2, 0, 2, 2, 2, 1, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 1, 2, 2, 0, 2, 2,
       1, 2, 2, 2, 0, 2, 1, 2, 0, 0, 1, 2, 0, 2, 0, 2, 2, 0, 2, 2, 0, 0,
       1, 2, 1, 1, 0, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 0, 2, 2, 2, 0, 0,
       2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1,
       2, 0, 2, 2, 0, 2, 1, 2, 0, 2, 2, 2, 0, 2, 2, 0, 1, 2, 0, 2, 0, 2,
       2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 0, 2,
       2, 0, 2, 2, 2, 0, 2, 2, 2, 2, 1, 2, 1, 2, 2, 2, 2, 2, 0, 0, 1, 2,
       1, 2, 2, 2, 2, 0, 2, 2, 2, 0, 1, 0, 2, 2, 2, 2, 1, 0, 2, 2, 0, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1,
       2, 2, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 0, 2, 1, 2, 2, 2,
       1, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 2, 2, 2, 1, 2, 1, 2, 2, 2, 2, 0,
       2, 2, 2, 1, 2, 0, 0, 2, 2, 0, 0, 2, 2, 0, 1, 1, 2, 1, 2, 2, 0, 0,
       0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 1, 2, 2, 0, 2, 2, 2, 0,
       1, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       0, 2, 0, 2, 2, 2, 1, 1, 2, 0, 0, 2, 1, 2, 0, 0, 1, 0, 0, 2, 2, 0,
       2, 0, 2, 0, 0, 2, 0, 0, 2, 2, 2, 2, 2, 2, 1, 0, 2, 2, 2, 0, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2,
       2, 2, 0, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 0, 2, 0, 2, 2, 2, 1, 2, 2,
       2, 2, 2, 2, 2, 2, 1, 0, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       0, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 0, 2, 2, 2, 2, 1, 1, 2, 2, 0,
       2, 2, 2, 2, 1, 2, 2, 0, 2, 2, 2, 1, 2, 2, 2, 2, 0, 0, 0, 1, 2, 2,
       2, 2, 2, 0, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 0, 2, 2, 0, 2, 2,
       0, 2, 1, 0, 2, 2, 0, 0, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2,
       2, 1, 2, 2, 2, 2, 0, 2, 2, 0, 2, 0, 0, 2, 2, 0, 2, 2, 2, 0, 2, 1,
       2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 1, 1, 2, 2,
       2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 1, 2, 2, 1, 2, 2, 0, 2, 2, 2, 2, 2,
       2, 2, 2, 0, 2, 2, 0, 0, 2, 0, 2, 2, 2, 2, 2, 1, 1, 2, 2, 1, 2, 0,
       2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 0,
       2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 1, 0, 2, 0, 2, 0, 1,
       2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 2, 2, 0, 2, 1, 2, 2, 2, 2, 2, 2, 2,
       2, 1, 2, 2, 2, 0, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2,
       2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 0, 1, 1, 2,
       2, 2, 2, 0, 2, 2, 1, 2, 1, 2, 0, 2, 2, 2, 2, 2, 2, 1, 2, 0, 1, 2,
       2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 1, 2, 0, 1, 2, 0, 2, 0, 2, 2, 0,
       2, 2, 2, 0, 2, 2, 0, 0, 2, 2, 2, 0, 2, 0, 2, 2, 0, 2, 2, 2, 2, 2,
       0, 0, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 0, 0, 2, 2, 2, 0,
       2, 2, 2, 2, 2, 1, 2, 2, 2, 0, 1])

In [ ]:
dfemb = pd.DataFrame(emb_trans, columns = ["EMBARKED"])

In [ ]:
dfemb.head()

   EMBARKED
0         2
1         0
2         2
3         2
4         2

In [ ]:
X= pd.concat([X,dfemb], axis = 1)

In [ ]:
X.head()

   Survived  Pclass   Age     Fare  male  EMBARKED
0         0       3  22.0   7.2500     1         2
1         1       1  38.0  71.2833     0         0
2         1       3  26.0   7.9250     0         2
3         1       1  35.0  53.1000     0         2
4         0       3  35.0   8.0500     1         2

In [ ]:
X.drop("EMBARKED", axis = 1, inplace = True)

In [ ]:
X.drop("Survived", axis=1, inplace = True)

In [ ]:
X

     Pclass   Age     Fare  male  EMBARKED
0         3  22.0   7.2500     1         2
1         1  38.0  71.2833     0         0
2         3  26.0   7.9250     0         2
3         1  35.0  53.1000     0         2
4         3  35.0   8.0500     1         2
..      ...   ...      ...   ...       ...
886       2  27.0  13.0000     1         2
887       1  19.0  30.0000     0         2
888       3   NaN  23.4500     0         2
889       1  26.0  30.0000     1         0
890       3  32.0   7.7500     1         1

[891 rows x 5 columns]

In [ ]:
X.isnull().sum()

Pclass      0
Age         0
Fare        0
male        0
EMBARKED    0
dtype: int64

In [ ]:
X.head()

   Pclass   Age     Fare  male  EMBARKED
0       3  22.0   7.2500     1         2
1       1  38.0  71.2833     0         0
2       3  26.0   7.9250     0         2
3       1  35.0  53.1000     0         2
4       3  35.0   8.0500     1         2

In [ ]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
Xtrain, Xtest, ytrain, ytest = train_test_split(X,y,test_size = 0.20)

In [ ]:
from sklearn.ensemble import GradientBoostingClassifier

In [ ]:
GBC = GradientBoostingClassifier(learning_rate= 0.75 , n_estimators=20, max_depth=3, max_features=2)

In [ ]:
GBC.fit(Xtrain, ytrain)

GradientBoostingClassifier(ccp_alpha=0.0, criterion='friedman_mse', init=None,
                           learning_rate=0.75, loss='deviance', max_depth=3,
                           max_features=2, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=20,
                           n_iter_no_change=None, presort='deprecated',
                           random_state=None, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [ ]:
ypredict = GBC.predict(Xtest)

In [ ]:
ypredict

array([1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0])

In [ ]:
GBC.score(Xtest, ytest)

0.8268156424581006

In [ ]:
lrate = [0.05, 0.1,0.25,0.5, 0.75, 0.90, 1]

In [ ]:
for rate in lrate:
  GBC = GradientBoostingClassifier(learning_rate= rate , n_estimators=20, max_depth=3, max_features=None)
  GBC.fit(Xtrain, ytrain)
  print("Learning Rate : ",rate, "\tScore : ", GBC.score(Xtest, ytest)*100)

Learning Rate :  0.05 	Score :  78.2122905027933
Learning Rate :  0.1 	Score :  77.6536312849162
Learning Rate :  0.25 	Score :  80.44692737430168
Learning Rate :  0.5 	Score :  79.3296089385475
Learning Rate :  0.75 	Score :  83.79888268156425
Learning Rate :  0.9 	Score :  82.68156424581005
Learning Rate :  1 	Score :  81.00558659217877

MAKE_CLASSIFICATION (SKLEARN.DATASETS)

In [ ]:
from sklearn.datasets import make_classification

In [ ]:
X, y = make_classification(n_samples = 1000, n_features = 10)

In [ ]:
X.shape

(1000, 10)

In [ ]:
y.shape

(1000,)

In [ ]:
from sklearn.model_selection import KFold, cross_val_score

In [ ]:
GBC1 = GradientBoostingClassifier(learning_rate=0.5, n_estimators = 30)

In [ ]:
kf = KFold(n_splits = 10)

In [ ]:
kfscore = cross_val_score(GBC1, X, y, cv = kf)

In [ ]:
for i in kfscore:
  print(i*100)

print("Score Means : ",kfscore.mean()*100)

93.0
94.0
91.0
90.0
84.0
97.0
92.0
92.0
90.0
92.0
Score Means :  91.5